name: "isolation_forest"
backend: "onnxruntime"
max_batch_size: 0
input [
  {
    name: "float_input"
    data_type: TYPE_FP32
    dims: [-1, 10]
  }
]
output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [-1, 1]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
