name: "logistic_regression"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  {
    name: "float_input"
    data_type: TYPE_FP32
    dims: [-1, 4]
  }
]
output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [-1]
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ -1, 3 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
