name: "linear_regression"
backend: "onnxruntime"
max_batch_size: 0
input [
  {
    name: "float_input"
    data_type: TYPE_FP32
    dims: [ -1, 8 ]
  }
]
output [
  {
    name: "variable"
    data_type: TYPE_FP32
    dims: [ -1, 1 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
  }
]